In [71]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Обработка данных

In [72]:
# загрузим все данные
df1 = pd.read_excel('Кредиты в разрезе типов заёмщиков табл-1.xlsx').fillna(0) # заполним нулями пустые значения
df2 = pd.read_excel('Ипотечное кредитование физических лиц табл - 2.xlsx')
df3 = pd.read_excel('Кредиты физических лиц табл - 3.xlsx')
df4 = pd.read_excel('Объёмы секьюритизации табл - 4.xlsx')
df5 = pd.read_excel('Отзыв лицензий табл - 5.xlsx')
df6 = pd.read_excel('Курсы валют табл - 6.xlsx')

print('Shape df1: {}'.format(df1.shape))
print('Shape df2: {}'.format(df2.shape))
print('Shape df3: {}'.format(df3.shape))
print('Shape df4: {}'.format(df4.shape))
print('Shape df5: {}'.format(df5.shape))
print('Shape df6: {}'.format(df6.shape))

Shape df1: (822, 9)
Shape df2: (822, 5)
Shape df3: (822, 4)
Shape df4: (288, 2)
Shape df5: (1, 2)
Shape df6: (288, 2)

In [73]:
df1.sample(5)

    report_date  bank_code   FL  FEN   EN  NFEN   IP сurrency         value
72   2006-01-01       1481  0.0  1.0  1.0   1.0  1.0  FOREIGN  6.637772e+09
351  2010-04-01       1500  1.0  0.0  0.0   0.0  0.0      RUB  1.758504e+09
507  2023-04-01       1500  0.0  0.0  1.0   1.0  1.0  FOREIGN  5.248927e+09
256  2021-05-01       1481  1.0  0.0  0.0   0.0  0.0  FOREIGN  8.722465e+10
518  2015-03-01       1600  1.0  0.0  0.0   0.0  0.0      RUB  8.953480e+08

In [74]:
df2.sample(5)

    report_date  bank_code сurrency  type    debt_total
506  2023-03-01       1500      RUB   3.1  5.680623e+07
570  2019-07-01       1600      RUB   1.1  8.969857e+07
25   2002-02-01       1481      RUB   1.1  6.102156e+07
655  2013-02-01       1700      RUB   3.1  3.584549e+07
329  2008-06-01       1500      RUB   1.1  1.386379e+07

Далее объеденим все таблицы в единую, для удобной работы.

In [75]:
# Объеденеяем первую и вторую таблицу
data = df1.join(df2, how='left', rsuffix='2')
data.sample(3)

,report_date,bank_code,FL,FEN,EN,NFEN,IP,сurrency,value,report_date2,bank_code2,сurrency2,type,debt_total
572,2019-09-01,1600,0.0,1.0,0.0,0.0,0.0,RUB,8.003165e+08,2019-09-01,1600,RUB,1.1,8.614651e+07
747,2020-10-01,1700,0.0,0.0,1.0,1.0,1.0,RUB,3.859071e+09,2020-10-01,1700,RUB,1.1,7.461111e+07
25,2002-02-01,1481,0.0,1.0,0.0,0.0,0.0,RUB,4.291871e+08,2002-02-01,1481,RUB,1.1,6.102156e+07

In [76]:
# Удалим дубликаты признаков 
data = data.drop(columns=['bank_code2', 'report_date2'])
data.sample(4)

,report_date,bank_code,FL,FEN,EN,NFEN,IP,сurrency,value,сurrency2,type,debt_total
576,2020-01-01,1600,0.0,1.0,0.0,0.0,0.0,RUB,7.687808e+08,RUB,1.1,7.945880e+07
198,2016-07-01,1481,0.0,0.0,1.0,1.0,1.0,RUB,3.466279e+08,RUB,3.1,9.789397e+07
224,2018-09-01,1481,0.0,0.0,1.0,1.0,1.0,FOREIGN,4.131172e+09,RUB,1.1,1.204286e+08
77,2006-06-01,1481,0.0,1.0,1.0,1.0,1.0,FOREIGN,8.882836e+09,RUB,3.1,9.234874e+07

In [77]:
# Теперь добавим третью таблицу
data = data.join(df3, how='left', rsuffix='3')
data.sample(3)

,report_date,bank_code,FL,FEN,EN,NFEN,IP,сurrency,value,сurrency2,type,debt_total,report_date3,value3,credits_type,debt_total3
642,2012-01-01,1700,0.0,1.0,0.0,0.0,0.0,RUB,4.051633e+08,RUB,1.1,3.231823e+07,2012-01-01,1700,автокредиты,7.430298e+06
460,2019-05-01,1500,1.0,0.0,0.0,0.0,0.0,FOREIGN,8.308136e+08,RUB,1.1,3.937418e+07,2019-05-01,1500,автокредиты,6.716070e+07
445,2018-02-01,1500,0.0,1.0,0.0,0.0,0.0,FOREIGN,8.753453e+08,RUB,3.1,3.493844e+07,2018-02-01,1500,потребы,5.820067e+07

In [78]:
# Удалим дубликаты признаков
data = data.drop(columns=['report_date3', 'value3'])
data.sample(3)

,report_date,bank_code,FL,FEN,EN,NFEN,IP,сurrency,value,сurrency2,type,debt_total,credits_type,debt_total3
433,2017-02-01,1500,0.0,0.0,1.0,1.0,1.0,FOREIGN,9.875454e+08,RUB,3.1,3.175244e+07,автокредиты,5.289341e+07
702,2017-01-01,1700,0.0,1.0,0.0,0.0,0.0,RUB,2.803618e+08,RUB,1.1,5.212902e+07,потребы,3.553336e+07
62,2005-03-01,1481,1.0,0.0,0.0,0.0,0.0,FOREIGN,3.706497e+09,RUB,3.1,8.194510e+07,автокредиты,6.446689e+07

In [79]:
# Теперь добавим четвертую таблицу
data = data.merge(df4, how='left', left_on='report_date', right_on='report_date')
data.sample(3)

,report_date,bank_code,FL,FEN,EN,NFEN,IP,сurrency,value_x,сurrency2,type,debt_total,credits_type,debt_total3,value_y
749,2020-12-01,1700,0.0,1.0,0.0,0.0,0.0,RUB,4.336052e+09,RUB,1.1,7.580966e+07,потребы,2.244932e+08,161117.578171
69,2005-10-01,1481,1.0,0.0,0.0,0.0,0.0,FOREIGN,5.573201e+09,FOREIGN,1.1,8.664564e+07,потребы,1.035197e+08,936880.669241
541,2017-02-01,1600,0.0,0.0,1.0,1.0,1.0,RUB,9.592092e+08,RUB,1.1,7.322587e+07,потребы,4.900306e+07,116892.670283

In [80]:
# Теперь добавим шестую таблицу
data = data.merge(df6, how='left', left_on='report_date', right_on='date')
data.sample(3)

,report_date,bank_code,FL,FEN,EN,NFEN,IP,сurrency,value_x,сurrency2,type,debt_total,credits_type,debt_total3,value_y,date,rate
659,2013-06-01,1700,1.0,0.0,0.0,0.0,0.0,FOREIGN,7.892178e+08,RUB,1.1,3.700638e+07,потребы,6.579648e+06,85998.440414,2013-06-01,63
300,2006-01-01,1500,0.0,1.0,1.0,1.0,1.0,RUB,1.113510e+09,RUB,3.1,1.100339e+07,автокредиты,4.431924e+07,956693.206103,2006-01-01,55
204,2017-01-01,1481,0.0,0.0,1.0,1.0,1.0,RUB,6.140724e+08,RUB,1.1,1.026879e+08,автокредиты,5.058354e+09,116080.109517,2017-01-01,58

In [81]:
# Удалим дубликаты признаков
data = data.drop(columns='date')
data.sample(3)

,report_date,bank_code,FL,FEN,EN,NFEN,IP,сurrency,value_x,сurrency2,type,debt_total,credits_type,debt_total3,value_y,rate
437,2017-06-01,1500,0.0,1.0,1.0,1.0,1.0,RUB,9.486322e+08,RUB,1.1,3.278078e+07,потребы,5.460642e+07,120200.192154,55
52,2004-05-01,1481,0.0,1.0,0.0,0.0,0.0,FOREIGN,2.069689e+09,FOREIGN,3.1,7.566894e+07,автокредиты,3.277170e+07,832114.861969,52
27,2002-04-01,1481,0.0,1.0,0.0,0.0,0.0,FOREIGN,4.822346e+08,FOREIGN,1.1,6.200181e+07,автокредиты,7.623427e+06,698950.652971,65